
#### Terraform Plan 📖
* **Proyecto (Workspace):** `tech-talk-demo84`
* **Fichero de definición:** `project-definitions/demo-tech-talk.tfvars`
```terraform
Acquiring state lock. This may take a few moments...
module.project_factory.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=cX8]
module.project_factory.module.project-factory.google_project.main: Refreshing state... [id=projects/tech-talk-demo84-717f]
module.project_factory.module.project-factory.google_service_account.default_service_account[0]: Refreshing state... [id=projects/tech-talk-demo84-717f/serviceAccounts/project-service-account@tech-talk-demo84-717f.iam.gserviceaccount.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/artifactregistry.googleapis.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/cloudbuild.googleapis.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/iam.googleapis.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/compute.googleapis.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/container.googleapis.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/run.googleapis.com]
module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=tech-talk-demo84-717f/serviceusage.googleapis.com]
module.project_factory.module.project-factory.google_project_default_service_accounts.default_service_accounts[0]: Refreshing state... [id=projects/tech-talk-demo84-717f]
google_storage_bucket.tfstate_backend[0]: Refreshing state... [id=tech-talk-demo84-717f-tfstate]
google_service_account.cicd_runner_sa[0]: Refreshing state... [id=projects/tech-talk-demo84-717f/serviceAccounts/cicd-runner-sa@tech-talk-demo84-717f.iam.gserviceaccount.com]
google_iam_workload_identity_pool.github_pool[0]: Refreshing state... [id=projects/tech-talk-demo84-717f/locations/global/workloadIdentityPools/github-pool]
google_project_iam_binding.project_iam["roles/viewer"]: Refreshing state... [id=tech-talk-demo84-717f/roles/viewer]
google_project_iam_member.sa_predefined_roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=tech-talk-demo84-717f/roles/resourcemanager.projectIamAdmin/serviceAccount:cicd-runner-sa@tech-talk-demo84-717f.iam.gserviceaccount.com]
google_service_account_iam_member.sa_workload_identity_user[0]: Refreshing state... [id=projects/tech-talk-demo84-717f/serviceAccounts/cicd-runner-sa@tech-talk-demo84-717f.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/417589697567/locations/global/workloadIdentityPools/github-pool/attribute.repository/demo-project-factory/tech-talk-demo2]
google_iam_workload_identity_pool_provider.github_provider[0]: Refreshing state... [id=projects/tech-talk-demo84-717f/locations/global/workloadIdentityPools/github-pool/providers/github-provider]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_organization_policy.org_policies["compute.disableNestedVirtualization"] will be created
  + resource "google_project_organization_policy" "org_policies" {
      + constraint  = "compute.disableNestedVirtualization"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "tech-talk-demo84-717f"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # google_project_organization_policy.org_policies["compute.restrictResourceManagerProjects"] will be created
  + resource "google_project_organization_policy" "org_policies" {
      + constraint  = "compute.restrictResourceManagerProjects"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "tech-talk-demo84-717f"
      + update_time = (known after apply)
      + version     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
**Acción Requerida:** Un revisor debe [aprobar el despliegue](https://github.com/demo-project-factory/tech-talk-demo/actions/runs/18967507177) para continuar con el `apply`.
